{
    "skills": [
        {
            "title": "Primary Skills",
            "values": [
                "Java",
                "Spring Boot",
                "JUnit"
            ]
        },
        {
            "title": "Secondary",
            "values": [
                "Kafka",
                "Angular",
                "TypeScript",
                "JavaScript",
                "Python",
                "RestAPI"
            ]
        },
        {
            "title": "Clouds",
            "values": [
                "AWS",
                "GCP"
            ]
        },
        {
            "title": "Database",
            "values": [
                "MySQL",
                "MongoDB",
                "Postgres"
            ]
        },
        {
            "title": "Others tools",
            "values": [
                "Git",
                "GitHub",
                "Jira"
            ]
        }
    ],
    "experience": {
        "companyName": "Accenture",
        "location" : "Kolkata",
        "role": "Custom Software Engeering Sr Analyst",
        "startDate": "Dec, 2021",
        "endDate": null,
        "isPresent": true,
        "points": [
            "Optimized High-Volume Batch Processing: Engineered a multithreaded batch processing engine using ExecutorService and Thread Pooling, processing 5,000 records per iteration across 495 chained iterations. This optimization reduced overall execution time by 60% and minimized system resource utilization.",
            "Accelerated API Workflow Automation: Automated a complex multi-step API workflow using CompletableFuture to orchestrate sequential calls, dynamically transforming responses to construct and post downstream requests, significantly accelerating update cycles and reducing manual intervention.",
            "Enhanced System Reliability and Monitoring: Set up an auto-retry mechanism for critical third-party API calls using Spring-Retry, boosting the API success rate from ~70%. Also implemented failure-triggered email notifications for prompt issue resolution and SLA adherence.",
            "Developed Core Middleware Services: Implemented a high-performance middleware service using Spring Boot and Java to enable seamless, consistent, and secure data transmission between diverse upstream and downstream systems",
            "Built Scalable Event-Driven Architecture: Developed Kafka producer integration to dynamically publish categorized payloads to multiple topics, enhancing system decoupling and ensuring a scalable event-driven architecture.",
            "Enforced Quality through TDD: Followed a Test-Driven Development (TDD) approach with JUnit & Mockito, achieving >85% code coverage while validating functionality, error handling, and edge cases"
        ]
    },
    "projects": [
        {
            "title": "Expense Manager",
            "subtitle": "Personal in-out money flow application",
            "descriptions": [
                "It's a combination of microservice backend model",
                "Build with angular"
            ],
            "tags": [
                "Java",
                "Spring Boot",
                "Angular",
                "MySQL"
            ],
            "githubLink": "https://github.com/sayancoding/Expense_Manager",
            "liveLink": "https://github.com/sayancoding/Expense_Manager"
        }
    ],
    "about": [
         [
            "Developed a high-performance Spring Boot middleware service for seamless, high-integrity data transmission and designed RESTful APIs to expedite client/application integration.",
            "Integrated a robust data validation and business rule enforcement layer, reducing downstream errors by 30% and improving data quality.",
            "Implemented Kafka producer integration for dynamic, categorized payload publishing, ensuring system decoupling and scalable event-driven architecture."
        ],
         [
            "Built an auto-retry mechanism (Spring-Retry) for critical third-party APIs, improving success rates, and leveraged Caffeine in-memory cache to reduce authentication token calls by 60% and boost API throughput.",
            "Ensured HIPAA/data security compliance by implementing PHI tokenization and persisting transaction logs in MongoDB; also developed AWS Lambda functions for secure audit data extracts to S3.",
            "Engineered a multithreaded batch processing engine (ExecutorService) and optimized an API workflow with CompletableFuture (3 APIs), accelerating execution and reducing overall processing time by 60%.",
            "Followed a TDD approach with JUnit/Mockito, achieving >85% code coverage, and set up failure-triggered email notifications to maintain business continuity and SLAs."
        ]
    ]
}